//?Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
// let arr1 = [1, 2, 3]
// let arr2 = [4, 5, 6]
// console.log(arr1.concat(arr2))

//?Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
// let arr = [1, 2, 3]
// console.log(arr.reverse())

//?Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// let arr = [1, 2, 3]
// arr.push(4, 5, 6)
// console.log(arr)

//?Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
// let arr = [1, 2, 3]
// arr.unshift(4, 5, 6)
// console.log(arr)

//?Дан массив ['js', 'css', 'jq']. Выведите в консоли  первый элемент.
//?Дан массив ['js', 'css', 'jq']. Выведите а консоли последний элемент
// let arr = ['js', 'css', 'jq']
// console.log(arr.slice(0,1))
// console.log(arr.slice(2,3))

// let arr = [1, 2, 3, 4, 5]
// //? Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// console.log(arr.slice(0, 3))

// //?  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].
// console.log(arr.slice(3))

// //? Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// console.log(arr.splice(0, 3, 2, 3, 4))

//?  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].


//?  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].


//? Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].





